parent("Ярослав Вельтман", "Лина Вельтман").
parent("Татьяна Романенко", "Лина Вельтман").
parent("Ярослав Вельтман", "Велизар Вельтман").
parent("Татьяна Романенко", "Велизар Вельтман").
parent("Виктор Романенко", "Татьяна Романенко").
parent("Зоя Масленкова", "Татьяна Романенко").
parent("Павел Вельтман", "Ярослав Вельтман").
parent("Наталья Уткина", "Ярослав Вельтман").
parent("Павел Вельтман", "Елена Вельтман").
parent("Наталья Уткина", "Елена Вельтман").
parent("Иван Уткин", "Наталья Уткина").
parent("Нина Ковалёва", "Наталья Уткина").
parent("Иван Уткин", "Юрий Уткин").
parent("Нина Ковалёва", "Юрий Уткин").
parent("Анатолий Масленков", "Зоя Масленкова").
parent("Анна Емелькина", "Зоя Масленкова").
parent("Анатолий Масленков", "Галина Масленкова").
parent("Анна Емелькина", "Галина Масленкова").
parent("Анатолий Масленков", "Анатолий Масленков").
parent("Анна Емелькина", "Анатолий Масленков").
parent("Анатолий Масленков", "Вячеслав Масленков").
parent("Анна Емелькина", "Вячеслав Масленков").
parent("Анатолий Масленков", "Александр Масленков").
parent("Анна Емелькина", "Александр Масленков").
parent("Николай Вельтман", "Павел Вельтман").
parent("Евгения Добрецова", "Павел Вельтман").
parent("Николай Вельтман", "Олег Вельтман").
parent("Евгения Добрецова", "Олег Вельтман").
parent("Николай Вельтман", "Александр Вельтман").
parent("Евгения Добрецова", "Александр Вельтман").
parent("Григорий Романенко", "Виктор Романенко").
parent("Валентина Романенко", "Виктор Романенко").
parent("Григорий Романенко", "Лида Романенко").
parent("Валентина Романенко", "Лида Романенко").
parent("Дмитрий Бирюков", "Ульяна Бирюкова").
parent("Елена Вельтман", "Ульяна Бирюкова").
parent("Олег Вельтман", "Глеб Вельтман").
parent("Гульнара Бакаева", "Глеб Вельтман").
parent("Александр Вельтман", "Дмитрий Вельтман").
parent("Лариса Вельтман", "Дмитрий Вельтман").
parent("Виктор Алишкин", "Павел Алишкин").
parent("Галина Масленкова", "Павел Алишкин").
parent("Вячеслав Масленков", "Анна Масленкова").
parent("Наталья Козырь", "Анна Масленкова").
parent("Анатолий Масленков", "Алексей Масленков").
parent("Алла Кузнецова", "Алексей Масленков").
parent("Анатолий Масленков", "Анастасия Масленкова").
parent("Алла Кузнецова", "Анастасия Масленкова").
parent("Глеб Вельтман", "Елизавета Вельтман").
parent("Лира Багирова", "Елизавета Вельтман").
parent("Глеб Вельтман", "Лев Вельтман").
parent("Лира Багирова", "Лев Вельтман").
parent("Александр Масленков", "Сергей Масленков").
parent("Светлана Львова", "Сергей Масленков").
parent("Александр Масленков", "Татьяна Масленкова").
parent("Светлана Львова", "Татьяна Масленкова").
parent("Анатолий Масленков", "Алексей Масленков").
parent("Елена Туз", "Алексей Масленков").
parent("Анатолий Масленков", "Анастасия Масленкова").
parent("Елена Туз", "Анастасия Масленкова").
parent("Михаил Емелькин", "Анна Емелькина").
parent("Марфа Иванова", "Анна Емелькина").
parent("Михаил Емелькин", "Евдокия Емелькина").
parent("Марфа Иванова", "Евдокия Емелькина").
parent("Михаил Емелькин", "Екатерина Емелькина").
parent("Марфа Иванова", "Екатерина Емелькина").
parent("Михаил Емелькин", "Алексей Емелькин").
parent("Марфа Иванова", "Алексей Емелькин").
parent("Павел Алишкин", "Тимур Алишкин").
parent("Елена Бутримова", "Тимур Алишкин").
parent("Вадим Ковалёв", "Артём Ковалёв").
parent("Елена Бутримова", "Артём Ковалёв").
sex("Нина Ковалёва", "female").
sex("Иван Уткин", "male").
sex("Анна Емелькина", "female").
sex("Анатолий Масленков", "male").
sex("Галина Масленкова", "female").
sex("Анатолий Масленков", "male").
sex("Вячеслав Масленков", "male").
sex("Александр Масленков", "male").
sex("Юрий Уткин", "male").
sex("Николай Вельтман", "male").
sex("Григорий Романенко", "male").
sex("Валентина Романенко", "female").
sex("Ульяна Бирюкова", "female").
sex("Дмитрий Бирюков", "male").
sex("Олег Вельтман", "male").
sex("Александр Вельтман", "male").
sex("Глеб Вельтман", "male").
sex("Дмитрий Вельтман", "male").
sex("Лариса Вельтман", "female").
sex("Евгения Добрецова", "female").
sex("Павел Алишкин", "male").
sex("Виктор Алишкин", "male").
sex("Анна Масленкова", "female").
sex("Наталья Козырь", "female").
sex("Алла Кузнецова", "female").
sex("Гульнара Бакаева", "female").
sex("Лира Багирова", "female").
sex("Елизавета Вельтман", "female").
sex("Алексей Масленков", "male").
sex("Анастасия Масленкова", "female").
sex("Елена Туз", "female").
sex("Светлана Львова", "female").
sex("Сергей Масленков", "male").
sex("Татьяна Масленкова", "female").
sex("Алексей Масленков", "male").
sex("Анастасия Масленкова", "female").
sex("Михаил Емелькин", "male").
sex("Марфа Иванова", "female").
sex("Лев Вельтман", "male").
sex("Елена Бутримова", "female").
sex("Вадим Ковалёв", "male").
sex("Артём Ковалёв", "male").
sex("Тимур Алишкин", "male").
sex("Лида Романенко", "female").
sex("Евдокия Емелькина", "female").
sex("Екатерина Емелькина", "female").
sex("Алексей Емелькин", "male").
sex("Ярослав Вельтман", "male").
sex("Татьяна Романенко", "female").
sex("Лина Вельтман", "female").
sex("Зоя Масленкова", "female").
sex("Виктор Романенко", "male").
sex("Наталья Уткина", "female").
sex("Павел Вельтман", "male").
sex("Велизар Вельтман", "male").
sex("Елена Вельтман", "female").

sibling(Sibling, Person):-
parent(P, Person),
parent(P, Sibling),
Person \= Sibling.

cousin(Cousin, Person):-
parent(P1, Person),
parent(P2, Cousin),
sibling(P1, P2),
sex(Cousin, "male"),
Person \= Cousin.
